<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;
use Backpack\CRUD\CrudTrait;

class Photo extends Model
{
    use CrudTrait, OfHouse;

    /*
    |--------------------------------------------------------------------------
    | GLOBAL VARIABLES
    |--------------------------------------------------------------------------
    */

    const CATEGORIES = [
        '封面图' => '封面图',
        '效果图' => '效果图',
        '实景图' => '实景图',
        '样板间' => '样板间',
        '区位' => '区位',
        '小区配套' => '小区配套',
        '项目现场' => '项目现场',
        '预售许可证' => '预售许可证',
        '开发商营业执照' => '开发商营业执照',
    ];

    protected $table = 'photos';
    protected $guarded = ['id'];

    /*
    |--------------------------------------------------------------------------
    | FUNCTIONS
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | RELATIONS
    |--------------------------------------------------------------------------
    */


    /*
    |--------------------------------------------------------------------------
    | SCOPES
    |--------------------------------------------------------------------------
    */

    public function scopeOfHouse($query, $house_id)
    {
        return $query->where('house_id', $house_id);
    }

    public function scopeOfCategory($query, $category)
    {
        return $query->where('category', $category);
    }


    /*
    |--------------------------------------------------------------------------
    | ACCESORS
    |--------------------------------------------------------------------------
    */

    public function getUrlAttribute()
    {
        return image_url($this->attributes['url']);
    }

    /*
    |--------------------------------------------------------------------------
    | MUTATORS
    |--------------------------------------------------------------------------
    */
}
