<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;
use Backpack\CRUD\CrudTrait;

class Tab extends Model
{
    use CrudTrait, Intime;

    /*
    |--------------------------------------------------------------------------
    | GLOBAL VARIABLES
    |--------------------------------------------------------------------------
    */
    const LINK_DATAS = [
        '/pages/house/home/index' => '首页',
        '/pages/article/index'    => '房友圈',
        '/pages/question/index'   => '答疑',
        '/pages/account/index'    => '我的'
    ];

    protected $table = 'tabs';
    protected $guarded = [ 'id' ];

    /*
    |--------------------------------------------------------------------------
    | FUNCTIONS
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | RELATIONS
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | SCOPES
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | ACCESORS
    |--------------------------------------------------------------------------
    */

    public function getPhotoAttribute()
    {
        return image_url($this->attributes[ 'photo' ]);
    }

    public function getPhotoSelectedAttribute()
    {
        return image_url($this->attributes[ 'photo_selected' ]);
    }

    /*
    |--------------------------------------------------------------------------
    | MUTATORS
    |--------------------------------------------------------------------------
    */
}
